# Дана строка. Преобразовать в ней все строчные буквы (как латинские, так и русские)
# в прописные, а прописные — в строчные.


text = input('введите текст: ')
print(text.swapcase())
